tap "cue-lang/tap"
tap "danielfoehrkn/switch"
tap "fluxcd/tap"
tap "go-task/tap"
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "norwoodj/tap"
tap "robusta-dev/krr"
tap "siderolabs/tap"
tap "stefanprodan/tap"
brew "age"
brew "xz"
brew "argocd"
brew "bash"
brew "bat"
brew "readline"
brew "openjdk"
brew "bfg"
brew "cilium-cli"
brew "colima"
brew "coreutils"
brew "cosign"
brew "curl"
brew "diff-so-fancy"
brew "difftastic"
brew "dive"
brew "docker"
brew "docker-buildx"
brew "docker-compose"
brew "docker-credential-helper"
brew "dos2unix"
brew "eza"
brew "fdupes"
brew "ffmpeg"
brew "findutils"
brew "fnm"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitleaks"
brew "glab"
brew "gnu-sed"
brew "go"
brew "gradle"
brew "graphviz"
brew "grep"
brew "hadolint"
brew "hcloud"
brew "helm"
brew "helmfile"
brew "hexyl"
brew "hugo"
brew "imagemagick"
brew "jq"
brew "k6"
brew "k9s"
brew "kind"
brew "kubernetes-cli"
brew "krew"
brew "kubeconform"
brew "kustomize"
brew "libpq", link: true
brew "make"
brew "mas"
brew "maven"
brew "mdbook"
brew "minikube"
brew "mtr"
brew "ncdu"
brew "neovim"
brew "opentofu"
brew "oras"
brew "pipx"
brew "pkgconf"
brew "pyenv"
brew "qemu"
brew "shellcheck"
brew "skaffold"
brew "socket_vmnet"
brew "sops"
brew "sponge"
brew "swaks"
brew "telnet"
brew "terraform-docs"
brew "tf-summarize"
brew "tflint"
brew "the_silver_searcher"
brew "tig"
brew "tree"
brew "trivy"
brew "watch"
brew "wget"
brew "yamllint"
brew "yq"
brew "zoxide"
brew "zsh"
brew "cue-lang/tap/cue"
brew "danielfoehrkn/switch/switch"
brew "fluxcd/tap/flux"
brew "go-task/tap/go-task"
brew "hashicorp/tap/packer"
brew "hashicorp/tap/terraform"
brew "norwoodj/tap/helm-docs"
brew "robusta-dev/krr/krr"
brew "siderolabs/tap/talosctl"
brew "stefanprodan/tap/timoni"
cask "adobe-acrobat-reader"
cask "amethyst"
cask "brave-browser"
cask "discord"
cask "drawio"
cask "dropbox"
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
cask "google-drive"
cask "gotomeeting"
cask "intune-company-portal"
cask "joplin"
cask "mactex-no-gui"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "musescore"
cask "signal"
cask "skim"
cask "slack"
cask "syntax-highlight"
cask "visual-studio-code"
cask "warp"
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
