tap "azure/kubelogin"
tap "buildpacks/tap"
tap "cue-lang/tap"
tap "danielgtaylor/restish"
tap "fluxcd/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "kube-score/tap"
tap "microsoft/mssql-release"
tap "norwoodj/tap"
tap "weaveworks/tap"
brew "actionlint"
brew "age"
brew "argocd"
brew "argocd-autopilot"
brew "asciidoctor"
brew "awscli"
brew "awslogs"
brew "azcopy"
brew "azure-cli"
brew "bash"
brew "bat"
brew "openjdk"
brew "bfg"
brew "cilium-cli"
brew "cloc"
brew "ncurses"
brew "colima"
brew "coreutils"
brew "cosign"
brew "curl"
brew "diff-so-fancy"
brew "dive"
brew "docker"
brew "docker-compose"
brew "docker-credential-helper"
brew "dos2unix"
brew "exa"
brew "fdupes"
brew "ffmpeg"
brew "findutils"
brew "fzf"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "gitup"
brew "go"
brew "graphviz"
brew "grepcidr"
brew "gron"
brew "hadolint"
brew "helm"
brew "helmfile"
brew "hexyl"
brew "httpie"
brew "hugo"
brew "hyperfine"
brew "hyperkit"
brew "imagemagick"
brew "ipcalc"
brew "jd"
brew "jq"
brew "k9s"
brew "kind"
brew "kubeconform"
brew "kubernetes-cli"
brew "kubectx"
brew "kubescape"
brew "kustomize"
brew "libpq", link: true
brew "mas"
brew "maven"
brew "mdbook"
brew "minikube"
brew "mtr"
brew "mysql"
brew "ncdu"
brew "neovim"
brew "nvm"
brew "openjdk@17"
brew "opentofu"
brew "oras"
brew "p7zip"
brew "pandoc"
brew "pre-commit"
brew "prettier"
brew "pv"
brew "pyenv"
brew "rbenv"
brew "rustup-init"
brew "shellcheck"
brew "sops"
brew "sponge"
brew "telnet"
brew "tflint"
brew "the_silver_searcher"
brew "tilt"
brew "tree"
brew "trivy"
brew "watch"
brew "wget"
brew "xmlstarlet"
brew "yamllint"
brew "yj"
brew "yq"
brew "zoxide"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "azure/kubelogin/kubelogin"
brew "buildpacks/tap/pack"
brew "cue-lang/tap/cue"
brew "danielgtaylor/restish/restish"
brew "fluxcd/tap/flux"
brew "kube-score/tap/kube-score"
brew "microsoft/mssql-release/mssql-tools"
brew "norwoodj/tap/helm-docs"
brew "weaveworks/tap/gitops"
cask "adobe-acrobat-reader"
cask "adobe-digital-editions"
cask "amethyst"
cask "bluejeans"
cask "brave-browser"
cask "calibre"
cask "cursor"
cask "drawio"
cask "dropbox"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-liberation"
cask "google-drive"
cask "joplin"
cask "mactex-no-gui"
cask "michaelvillar-timer"
cask "ngrok"
cask "onedrive"
cask "postman"
cask "powershell"
cask "signal"
cask "skim"
cask "syntax-highlight"
cask "telegram"
cask "tunnelblick"
cask "vagrant"
cask "virtualbox"
cask "visual-studio-code"
cask "warp"
cask "webex"
cask "zoom"
mas "GarageBand", id: 682658836
mas "Microsoft Remote Desktop", id: 1295203466
mas "Microsoft To Do", id: 1274495053
vscode "farosystemappender constructor"
vscode "vscodevim.vim"
