tap "danielfoehrkn/switch"
tap "fluxcd/tap"
tap "hashicorp/tap"
tap "oven-sh/bun"
tap "robusta-dev/krr"
tap "sdkman/tap"
tap "stefanprodan/tap"
# Simple, modern, secure file encryption
brew "age"
# Library for command-line editing
brew "readline"
# General-purpose data compression with high compression ratio
brew "xz"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# GitOps Continuous Delivery for Kubernetes
brew "argocd"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Development kit for the Java programming language
brew "openjdk"
# Remove large files or passwords from Git history like git-filter-branch
brew "bfg"
# Python code formatter
brew "black"
# Check Java source against a coding standard
brew "checkstyle"
# CLI to install, manage & troubleshoot Kubernetes clusters running Cilium
brew "cilium-cli"
# Statistics utility to count lines of code
brew "cloc"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima"
# Create and run Linux containers using lightweight virtual machines
brew "container"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Validate and define text-based and dynamic configuration
brew "cue"
# Get a file from an HTTP, HTTPS or FTP server
brew "curl"
# Modern diagram scripting language that turns text to diagrams
brew "d2"
# Static code analysis for Kotlin
brew "detekt"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Diff that understands syntax
brew "difftastic"
# Tool for exploring each layer in a docker image
brew "dive"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Docker CLI plugin for extended build capabilities with BuildKit
brew "docker-buildx"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Convert text between DOS, UNIX, and Mac formats
brew "dos2unix"
# Modern, maintained replacement for ls
brew "eza"
# Command-line batch renaming tool
brew "f2"
# Identify or delete duplicate files
brew "fdupes"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Collection of GNU find, xargs, and locate
brew "findutils"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Git extension for versioning large files
brew "git-lfs"
# Run gitlab pipelines locally as shell executor or docker executor
brew "gitlab-ci-local"
# Audit git repos for secrets
brew "gitleaks"
# Open-source GitLab command-line tool
brew "glab"
# GNU implementation of the famous stream editor
brew "gnu-sed"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Task is a task runner/build tool that aims to be simpler and easier to use
brew "go-task"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Graph visualization software from AT&T and Bell Labs
brew "graphviz"
# GNU grep, egrep and fgrep
brew "grep"
# Vulnerability scanner for container images and filesystems
brew "grype"
# Smarter Dockerfile linter to validate best practices
brew "hadolint"
# Command-line interface for Hetzner Cloud
brew "hcloud"
# Kubernetes package manager
brew "helm"
# Tool for automatically generating markdown documentation for helm charts
brew "helm-docs"
# Deploy Kubernetes Helm Charts
brew "helmfile"
# Command-line hex viewer
brew "hexyl"
# Configurable static site generator
brew "hugo"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# CLI for Infisical
brew "infisical"
# Sort Python imports automatically
brew "isort"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Run local Kubernetes cluster in Docker
brew "kind"
# CLI tool to discover unused Kubernetes resources
brew "kor"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Anti-bikeshedding Kotlin linter with built-in formatter
brew "ktlint"
# FAST Kubernetes manifests validator, with support for Custom Resources!
brew "kubeconform"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Postgres C API library
brew "libpq", link: true
# Utility for directing compilation
brew "make"
# CLI for Node.js style checker and lint tool for Markdown files
brew "markdownlint-cli"
# Mac App Store command-line interface
brew "mas"
# Java-based project management
brew "maven"
# Create modern online books from Markdown files
brew "mdbook"
# Syntax-aware git merge driver
brew "mergiraf"
# Run a Kubernetes cluster locally
brew "minikube"
# Replacement for ls, cp and other commands for object storage
brew "minio-mc"
# 'traceroute' and 'ping' in a single tool
brew "mtr"
# Experimental optional static type checker for Python
brew "mypy"
# NCurses Disk Usage
brew "ncdu"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# OCI Registry As Storage
brew "oras"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Generic machine emulator and virtualizer
brew "qemu"
# Rsync for cloud storage
brew "rclone"
# Persistent key-value database, with built-in net interface
brew "redis"
# Extremely fast Python linter, written in Rust
brew "ruff"
# Rust toolchain installer
brew "rustup"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Autoformat shell script source code
brew "shfmt"
# Daemon to provide vmnet.framework support for rootless QEMU
brew "socket_vmnet"
# Editor of encrypted files
brew "sops"
# Soak up standard input and write to a file
brew "sponge"
# JavaScript Style Guide, with linter & automatic code fixer
brew "standard"
# Opinionated Lua code formatter
brew "stylua"
# SMTP command-line test tool
brew "swaks"
# CLI for out-of-band management of Kubernetes nodes created by Talos
brew "talosctl"
# User interface to the TELNET protocol
brew "telnet"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv"
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# CLI to print the summary of the terraform plan
brew "tf-summarize"
# Linter for Terraform files
brew "tflint"
# Code-search similar to ack
brew "the_silver_searcher"
# Text interface for Git repositories
brew "tig"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Vulnerability scanner for container images, file systems, and Git repos
brew "trivy"
# Find and verify credentials
brew "trufflehog"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Linter for YAML files
brew "yamllint"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Suite of barcodes-reading tools
brew "zbar"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# The kubectx for operators.
brew "danielfoehrkn/switch/switch"
# Flux CLI
brew "fluxcd/tap/flux"
# Packer
brew "hashicorp/tap/packer"
# Incredibly fast JavaScript runtime, bundler, transpiler and package manager - all in one.
brew "oven-sh/bun/bun"
# Kubernetes Resource Recommender by Robusta
brew "robusta-dev/krr/krr"
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# Timoni CLI
brew "stefanprodan/tap/timoni"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# Automatic tiling window manager similar to xmonad
cask "amethyst"
# Web browser focusing on privacy
cask "brave-browser"
# E-books management software
cask "calibre"
# Voice and text chat software
cask "discord"
# Online diagram software
cask "drawio"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-hack-nerd-font"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "gcloud-cli"
# Web browser
cask "google-chrome"
# UI for Kubernetes
cask "headlamp"
# App to manage access to corporate apps, data, and resources
cask "intune-company-portal"
# Optimise and personalise your Jabra headset
cask "jabra-direct"
# Note taking and to-do application with synchronisation capabilities
cask "joplin"
# Optimise your webcam, headset, and Logi Dock for video meetings
cask "logitune"
# Full TeX Live distribution without GUI applications
cask "mactex-no-gui"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Email client
cask "microsoft-outlook"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Open-source music notation software
cask "musescore"
# Desktop sync client for Nextcloud software products
cask "nextcloud"
# Instant messaging application focusing on security
cask "signal"
# PDF reader and note-taking application
cask "skim"
# Quicklook extension for source files
cask "syntax-highlight"
# Development environment
cask "vagrant"
# Virtualiser for arm64 hardware
cask "virtualbox"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "GarageBand", id: 682658836
mas "iMovie", id: 408981434
mas "Keynote", id: 409183694
mas "Numbers", id: 409203825
mas "Pages", id: 409201541
mas "Things", id: 904280696
